#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.azurefunc will be created
  + resource "azurerm_container_registry" "azurefunc" {
      + admin_enabled       = false
      + admin_password      = (sensitive value)
      + admin_username      = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + login_server        = (known after apply)
      + name                = "acrazurefunc07985498"
      + network_rule_set    = (known after apply)
      + resource_group_name = "azurefunc"
      + sku                 = "Basic"
      + tags                = {
          + "app"                 = ""
          + "business_contact"    = "contact@example.com"
          + "business_unit"       = "IT"
          + "compliance"          = ""
          + "cost_center"         = "CCcloud"
          + "data_classification" = ""
          + "description"         = "Cloud Tools PoC"
          + "environment"         = "pro"
          + "expiration_date"     = ""
          + "managed_by"          = "manager@example.com"
          + "manteinance_window"  = ""
          + "project"             = "azurefunc"
          + "schedule"            = ""
          + "svc"                 = ""
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan Workflow`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./iac`*
